/* ============================================================================
 中央位置取得関数
 @coordinate "x", "y"
 @val coordinateが"x"の場合はセンタリングする画像のwidth、"y"の場合はheight
 --------------------------------------------------------------------------- */
var centerPos = function(coordinate, val) {
  if (coordinate == 'x') {
    var t_width = $('#tyrano_base').width();
    return (t_width - val) / 2;
  } else if (coordinate == 'y') {
    var t_height = $('#tyrano_base').height();
    return (t_height - val) / 2;
  }
}
// ============================================================================





/* ============================================================================
 乱数取得関数
 --------------------------------------------------------------------------- */
var randNum = function(min,max) {
  max = Number(max)
  min = Number(min)
  var rand = min + Math.floor(Math.random() * (max - min + 1))
  console.log("randNum: " + rand);
  return rand;
}
 // ===========================================================================





/* =============================================================================
TYRANOテキスト表示（注：瞬間表示のみ）
 --------------------------------------------------------------------------- */
 var tyranoText = function(text) {
   $(".current_span").text(text);
 }
// -----------------------------------------------------------------------------
